// Задача №21. 
// Напишите программу, которая принимает 
// на вход координаты двух точек и находит 
// расстояние между ними в 2D пространстве.
// A (3,6); B (2,1) -> 5,09 
// A (7,-5); B (1,-1) -> 7,21

double a = 4;
double b = 2;
double c = Math.Pow(a * a, b); // x ^ y
Console.WriteLine(c);

double d = Math.Sqrt(c);
Console.WriteLine(d);

